
## Plan Result (image-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/47547)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C
* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod:162" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ImageAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu                    = 0
                  - environment            = [
                      - {
                          - name  = "NODE_ENV"
                          - value = "production"
                        },
                      - {
                          - name  = "OTLP_COLLECTOR_HOST"
                          - value = "localhost"
                        },
                      - {
                          - name  = "REDIS_PRIMARY_ENDPOINT"
                          - value = "imageapi-prod.zcx42u.ng.0001.use1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "REDIS_READER_ENDPOINT"
                          - value = "imageapi-prod-ro.zcx42u.ng.0001.use1.cache.amazonaws.com"
                        },
                    ]
                  - essential              = true
                  - healthCheck            = {
                      - command     = [
                          - "CMD-SHELL",
                          - "curl -f http://localhost:4867/.well-known/apollo/server-health || exit 1",
                        ]
                      - interval    = 15
                      - retries     = 3
                      - startPeriod = 0
                      - timeout     = 5
                    }
                  - image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/imageapi-prod-app:e7f853e383f5cd65ac9e5c343be5d568ead5ea47"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group             = "/Backend/ImageAPI-Prod/ecs/app"
                          - awslogs-multiline-pattern = "^\\S.+"
                          - awslogs-region            = "us-east-1"
                          - awslogs-stream-prefix     = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "app"
                  - portMappings           = [
                      - {
                          - containerPort = 4867
                          - hostPort      = 4867
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - secrets                = [
                      - {
                          - name      = "IMAGE_CACHE_ENDPOINT"
                          - valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ImageAPI/Prod/IMAGE_CACHE_ENDPOINT"
                        },
                      - {
                          - name      = "SENTRY_DSN"
                          - valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ImageAPI/Prod/SENTRY_DSN"
                        },
                    ]
                  - volumesFrom            = []
                },
              - {
                  - command                = [
                      - "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  - cpu                    = 0
                  - environment            = []
                  - essential              = true
                  - image                  = "amazon/aws-otel-collector"
                  - logConfiguration       = {
                      - logDriver     = "awslogs"
                      - options       = {
                          - awslogs-group         = "/ecs/ImageAPI-Prod/aws-otel-collector20231215214959212300000001"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                      - secretOptions = []
                    }
                  - mountPoints            = []
                  - name                   = "aws-otel-collector"
                  - portMappings           = [
                      - {
                          - containerPort = 4138
                          - hostPort      = 4138
                          - protocol      = "tcp"
                        },
                      - {
                          - containerPort = 4137
                          - hostPort      = 4137
                          - protocol      = "tcp"
                        },
                    ]
                  - readonlyRootFilesystem = false
                  - repositoryCredentials  = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-1:996905175585:secret:Shared/DockerHub"
                    }
                  - volumesFrom            = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ id                       = "ImageAPI-Prod" -> (known after apply)
      ~ revision                 = 162 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ImageAPI"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_elasticache_serverless_cache.serverless_redis_elasticache_serverless_356B3FAF must be replaced
-/+ resource "aws_elasticache_serverless_cache" "serverless_redis_elasticache_serverless_356B3FAF" {
      ~ arn                      = "arn:aws:elasticache:us-east-1:996905175585:serverlesscache:imageapi-prod-serverless" -> (known after apply)
      ~ create_time              = "2024-02-12T19:15:04Z" -> (known after apply)
      ~ daily_snapshot_time      = "08:00" -> (known after apply)
      ~ endpoint                 = [
          - {
              - address = "imageapi-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
              - port    = 6379
            },
        ] -> (known after apply)
      ~ full_engine_version      = "7.1" -> (known after apply)
      ~ id                       = "imageapi-prod-serverless" -> (known after apply)
      ~ major_engine_version     = "7" -> (known after apply)
      ~ name                     = "imageapi-prod-serverless" -> "ImageAPI-Prod-serverless" # forces replacement
      ~ reader_endpoint          = [
          - {
              - address = "imageapi-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
              - port    = 6380
            },
        ] -> (known after apply)
      ~ snapshot_retention_limit = 0 -> (known after apply)
      ~ status                   = "available" -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ImageAPI"
        }
        # (5 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"a34f813a-3981-48e1-a51f-b8beefc4f3a6","JobName":"image-api_infrastructure_plan_prod","PRNumber":167,"Program":"tfcmt","SHA1":"aba1d5cecda603facd9261f1f1b39a2b490401ca","Target":"image-api-cdk","Vars":{}} -->